; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-81)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b20)
    (on b20 b14)
    (on b14 b18)
    (on-table b18)
    (clear b8)
    (on b8 b24)
    (on b24 b1)
    (on-table b1)
    (clear b16)
    (on b16 b2)
    (on b2 b19)
    (on b19 b6)
    (on b6 b12)
    (on b12 b15)
    (on b15 b17)
    (on b17 b4)
    (on-table b4)
    (clear b10)
    (on b10 b22)
    (on b22 b7)
    (on b7 b21)
    (on b21 b9)
    (on b9 b13)
    (on b13 b3)
    (on b3 b23)
    (on b23 b5)
    (on-table b5))
 (:goal (and 
(on-table b1)
(on b10 b13)
))
)

; plan
1. (unstack b10 b22)
   deleted: (on b10 b22) (clear b10) (arm-empty)
   added: (holding b10) (clear b22)
   goals met: 1 of 2
2. (stack b10 b11)
   deleted: (clear b11) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b11)
   goals met: 1 of 2
3. (unstack b22 b7)
   deleted: (on b22 b7) (clear b22) (arm-empty)
   added: (holding b22) (clear b7)
   goals met: 1 of 2
4. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 2
5. (unstack b7 b21)
   deleted: (on b7 b21) (clear b7) (arm-empty)
   added: (holding b7) (clear b21)
   goals met: 1 of 2
6. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 2
7. (unstack b21 b9)
   deleted: (on b21 b9) (clear b21) (arm-empty)
   added: (holding b21) (clear b9)
   goals met: 1 of 2
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 2
9. (unstack b9 b13)
   deleted: (on b9 b13) (clear b9) (arm-empty)
   added: (holding b9) (clear b13)
   goals met: 1 of 2
10. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
11. (unstack b10 b11)
   deleted: (on b10 b11) (clear b10) (arm-empty)
   added: (holding b10) (clear b11)
   goals met: 1 of 2
12. (stack b10 b13)
   deleted: (clear b13) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b13)
   goals met: 2 of 2
